{"title":"WhatSize Changelogs","url":"https://www.whatsizemac.com/release-notes/","favicon":"https://www.whatsizemac.com/release-notes/favicon.ico","elements":[{"title":"Version 7.6.5  :  Monday August 16","contents":"<li>Fixing TimeMachine support for macOS Big Sur</li>\n<li>Fixing Swift library linking issue that affects macOS systems older than 10.14</li>\n<li>Maintenance Fixes</li>","retrieved":1636349692007},{"title":"Version 7.6.4  :  Monday November 30","contents":"<li>Adding support for macOS Big Sur</li>\n<li>Addressed a rare issue that would cause an infinite loop on startup</li>\n<li>Addressed issue related to a mounted volume with missing volume UUID</li>\n<li>Addressed an issue related to improper TimeMachine</li>","retrieved":1636349692009},{"title":"Version 7.4.4  :  Monday August 10","contents":"<li>When measuring a parent folder, children that are present on the SideBar are automatically updated</li>\n<li>Addressed a small issue when handling the Request Activation Reset</li>\n<li>Added 'Empty Trash' menu item to empty the trash using Finder</li>\n<li>File counts are properly updated when the app performs background updates</li>","retrieved":1636349692011},{"title":"Version 7.4.3  :  Monday June 8, 2020","contents":"<li>Added support for managing local TimeMachine/APFS snapshots. These invisible files can fill up your disk. This feature is available on 10.15 and newer</li>","retrieved":1636349692012},{"title":"Version 7.4.1  :  Monday April 6, 2020","contents":"<li>Implemented Export As TSV, allowing for more data processing using Numbers.app or Microsoft Excel.app</li>\n<li>Addressed issues related to APFS (Apple File System)</li>\n<li>Addressed move to trash issues</li>","retrieved":1636349692021},{"title":"Version 7.3.3  :  Monday December 16, 2019","contents":"<li>Addressed issues related to macOS https://www.apple.com/macos/catalina</li>\n<li>Addressed issues that were causing large memory utilization</li>\n<li>Performance optimizations</li>","retrieved":1636349692021},{"title":"Version 7.2.1  :  Monday September 16, 2019","contents":"<li>Added support for macOS https://www.apple.com/macos/catalina</li>\n<li>Added code to automatically show/hide volumes in the sidebar as they are mounted/ejected from the Finder</li>","retrieved":1636349692023},{"title":"Version 7.1.1  :  Monday August 19, 2019","contents":"<li>Brought back the Table View mode (from v6), to allow a flat view of all files recursively</li>\n<li>Improved filtering on the Table View, Duplicate View and Cleaner View</li>\n<li>Fixes to the duplicate and file categorization engine</li>\n<li>This build will invalidate your current measures, please re-measure using the new 7.1.1 build</li>","retrieved":1636349692024},{"title":"Version 7.1.0  :  Monday July 15, 2019","contents":"<li>Added support for https://en.wikipedia.org/wiki/ExFAT file systems</li>\n<li>Added filtering by date/(date range) or size/(size range) to the duplicates view</li>","retrieved":1636349692024},{"title":"Version 7.0.9  :  Monday June 10, 2019","contents":"<li>Fixes to the PieChart View mode</li>\n<li>Fixes to Mojave DarkMode</li>","retrieved":1636349692035},{"title":"Version 7.0.8  :  Monday May 27, 2019","contents":"<li>Added Support for Apple's QuickLook Technology</li>\n<li>Fixed a few minor issues related to Mojave DarkMode</li>\n<li>Fixed a rare issue where the application was using excessive amounts of memory</li>\n<li>Updated the code base to be Swift 5 compliant</li>","retrieved":1636349692036},{"title":"Version 7.0.7  :  Monday May 20, 2019","contents":"<li>In browser view mode, the count of files/folders will take in consideration the Show Hidden Files setting</li>\n<li>Adjusted string colors when in DarkMode</li>\n<li>Added Mail my Key for easy in app serial key retrieval</li>\n<li>Adjusted the default install location to be under /Applications</li>","retrieved":1636349692037},{"title":"Version 7.0.6  :  Monday May 13, 2019","contents":"<li>Completed the re-write in Swift 4 and Apple's newest file system Technologies</li>","retrieved":1636349692038},{"title":"Version 6.6.3  :  Monday November 27, 2017","contents":"<li>Compatibility with macOS High Sierra (10.13)</li>\n<li>General bug fixes.</li>","retrieved":1636349692045},{"title":"Version 6.5.4  :  Monday January 9, 2017","contents":"<li>Improvements to handle TimeMachine volumes on remote machines or on external drives.</li>\n<li>Improvements to physical (On Disk) file size accuracy.</li>\n<li>Better support for SMB mounted volumes.</li>\n<li>General bug fixes.</li>","retrieved":1636349692046},{"title":"Version 6.5.3  :  Monday September 19, 2016","contents":"<li>Updated to support macOS Sierra.</li>","retrieved":1636349692047},{"title":"Version 6.5.2  :  Monday July 11, 2016","contents":"<li>Sparkle updates are now using the more secure SSL protocol.</li>\n<li>When measuring SSD or Flash drives the app will scan a few times faster.</li>\n<li>Bug fixes and enhancements to printing.</li>\n<li>General bug fixes.</li>","retrieved":1636349692048},{"title":"Version 6.4.3  :  Monday December 7, 2015","contents":"<li>Added menu to disable MobileBackups.</li>\n<li>Added code to simplify serial key registration.</li>\n<li>Minor bug fixes.</li>","retrieved":1636349692048},{"title":"Version 6.4.1  :  Friday November 27, 2015","contents":"<li>Added support for MobileBackups (mtmfs), msdos and exfat file systems.</li>\n<li>Added support for sudo in trial mode.</li>","retrieved":1636349692049},{"title":"Version 6.3.2  :  Friday November 6, 2015","contents":"<li>Fixed crash related to database upgrade from 6.2.1</li>\n<li>Added support for symbolic links. We will account them as simple files of 4kb and adjust their icons. We will not follow links.</li>","retrieved":1636349692050},{"title":"Version 6.3.1  :  Monday October 5, 2015","contents":"<li>Blessed release for Apple's 10.11 ElCapitan Operating System.</li>\n<li>Implemented the ability to measure Time Machine volumes. The numbers are updated when measuring as admin. To reduce the measurement time we are closely estimating the size.</li>\n<li>Heavy File System Optimizations. We are seeing at least 25% improvement on a full disk scan and an order of magnitude with regard to the handling of Apple FSEvents.</li>\n<li>Addressed occasional application dead lock when measuring.</li>\n<li>Addressed issue related to folders with tens of thousands of files.</li>\n<li>Addressed file filtering issues when in locales other than English.</li>","retrieved":1636349692051},{"title":"Version 6.2.1  :  Monday June 8, 2015","contents":"<li>Implemented the ability to quickly measure separate folders rather than the whole volume. Drop a folder in the left side bar and measure it quickly</li>\n<li>Reduced memory usage by a good 15%</li>\n<li>Reduced time to open the database by 10%, making the app snapier on launch</li>\n<li>Added print button to the tool bar for easy access</li>\n<li>Refined activity window to display the current path being measured</li>\n<li>Reworked whatsized to use apple's sanctioned XPC interprocess architecture, this will allow for more flexibility for users wanting to scan their drives as Administrator</li>\n<li>Fixes to the German translation</li>\n<li>Fixed a rare crash related to multiple measures going on in parallel</li>\n<li>The app can now scan multiple volumes at once, however if multiple volumes reside on the same disk performance will be affected</li>","retrieved":1636349692052},{"title":"Version 6.2.0  :  Monday April 20, 2015","contents":"<li>Addressed issues related to autolayout on 10.8 systems</li>\n<li>Implemented Preferences 'Exclude' pane</li>\n<li>Implemented printing</li>","retrieved":1636349692055},{"title":"Version 6.1.8  :  Wednesday March 4, 2015","contents":"<li>Addressed issues related to localization</li>\n<li>Updated user guide</li>","retrieved":1636349692055},{"title":"Version 6.1.7  :  Monday February 23, 2015","contents":"<li>Addressed duplicate filtering when switching between sidebar items</li>\n<li>Addressed obscure crash when switching between sidebar items</li>\n<li>Addressed issue when adding/removing favorites from the sidebar</li>\n<li>Italian language pack translations</li>\n<li>French language pack translations</li>\n<li>German language pack translations</li>","retrieved":1636349692056},{"title":"Version 6.1.6  :  Monday February 9, 2015","contents":"<li>Overhaul of the duplicate UI for more flexibility</li>\n<li>Overhaul of the left sidebar view</li>\n<li>Upgraded to apple's autolayout</li>\n<li>Italian language pack</li>\n<li>Fixes to Apple's FSEvents support. This allows WhatSize to be synchronized with file system changes in real time</li>\n<li>Added ability to stop a measurement in progress</li>\n<li>Numerous stability fixes</li>\n<li>Numerous fixes to the UTI engine, a User Interface for this module is in the works</li>","retrieved":1636349692057},{"title":"Version 6.1.5  :  Monday January 5, 2015","contents":"<li>The application is now 64bit, it will consume a bit more memory but the advantages are far greater</li>\n<li>Initial support for Apple's FSEvents. This allows WhatSize to be synchronized with file system changes in real time</li>\n<li>Overhaul of the duplicate engine for 3 to 5 times faster duplicate finding</li>\n<li>Collecting uti type data for each file when measuring. This technology will allow WhatSize to display and manipulate data by uti type</li>\n<li>Adding support for hidden files on the browser view</li>\n<li>Adding sort button to the browser view mode</li>\n<li>Addressed issue related with the move to trash logic</li>\n<li>Addressed issue related to 64bit file systems</li>\n<li>Addressed issue related to ejectable volumes</li>\n<li>Addressed issue related to network volumes</li>\n<li>Addressed issue related to favorites bar</li>\n<li>Addressed issue related to the size refresh button on the left menu bar</li>\n<li>Addressed issue related to older registration keys</li>\n<li>Addressed numerous crash cases</li>\n<li>Right click \"Refresh (Selected Node)\" is working again</li>","retrieved":1636349692058},{"title":"Version 6.0.4  :  Monday September 8, 2014","contents":"<li>Reworked the database engine to allow faster, more accurate and more flexible file system size updates.</li>\n<li>Reworked the cleaning tools into one trivial window.</li>\n<li>Remove gigabytes of junk in one click.</li>\n<li>Added ability to replace duplicates with hard links. This will save disk space without breaking existing apps.</li>\n<li>Better handling of localized files.</li>\n<li>The application is now 64bit to benefit from latest Apple hardware.</li>\n<li>Dropped support for MAC OSX 10.6, Version 5.3.2, is the latest version that supports 10.6</li>","retrieved":1636349692058},{"title":"Version 5.3.2  :  Monday August 27, 2012","contents":"<li>Dropped support for MAC OSX 10.5, Version 5.2.1, is the latest version that supports 10.5</li>\n<li>The package installer and all binary products are now signed to conform with Apple's GateKeeper Technology.</li>\n<li>Addressed issuse where the file names started with '.Trash'.</li>\n<li>Addressed rare crash when moving duplicates into the Trash.</li>\n<li>Addressed issue of incorrect Trash icon.</li>\n<li>Addressed incorrect size formatting when exporting as CSV.</li>\n<li>Addressed file size calculations in Mountain Lion.</li>\n<li>Addressed issue with automatic graphics context switch to conserve battery time on laptops.</li>\n<li>Added FileName column on TableView mode.</li>","retrieved":1636349692059},{"title":"Version 5.2.1  :  Monday January 9, 2012","contents":"<li>Added preference pane to better handle CSV exports.</li>\n<li>Added measuring of TimeMachine volumes. This feature will help identify local TimeMachine snapshots.</li>\n<li>Dropped support for MAC OSX 10.4, Version 5.1.1, is the latest version that supports 10.4.</li>\n<li>Addressed rare crash related to missing local host name.</li>\n<li>Addressed rare crash related to the file system having changed from under the application.</li>","retrieved":1636349692060},{"title":"Version 5.1.1  :  Monday November 21, 2011","contents":"<li>This is mostly a maintenance release to comply with the Apple Mac Store.</li>\n<li>Added sorting by column header click in TableView mode.</li>","retrieved":1636349692061},{"title":"Version 5.0.6  :  Tuesday October 4, 2011","contents":"<li>The application will now suport Lion's full screen.</li>\n<li>Streamlined the user interface by merging the 'TableView' window with the main window.</li>\n<li>When finding duplicates the file that has the oldest modified date is considered to be the original.</li>\n<li>Addressed issue when removing files as Administrator.</li>\n<li>Addressed issue with the Find Duplicate tool bar button.</li>\n<li>Addressed issue with the ReMeasure tool bar button.</li>\n<li>Optimizations to the Find Duplicate engine.</li>\n<li>Addressed issue where some Duplicate files where not being shown.</li>","retrieved":1636349692061},{"title":"Version 5.0.4  :  Tuesday September 20, 2011","contents":"<li>The application will now suport Lion's full screen.</li>\n<li>Added \"CMD+D\", or right click context menu \"Select All Duplicates\". Now you can find and remove all duplicates in no time at all.</li>\n<li>Added code that invokes Finder's Empty Trash.</li>\n<li>Addressed issue with the activation server.</li>","retrieved":1636349692063},{"title":"Version 5.0.2  :  Tuesday August 8, 2011","contents":"<li>This release is now compatible with v10.7 Lion.</li>\n<li>Fixed Lion file size math. In Lion one KB is 1000 so apple went to multiples of 1000 rather than multiples of 1024 when displaying the compact file size.</li>\n<li>Addressed issue where path names contain '/' characters, Finder will convert these into ':'.</li>\n<li>Addressed issue where the browser view was not properly refreshing.</li>\n<li>Addressed issue where the Sparkle updates were causing a deadlock.</li>","retrieved":1636349692064},{"title":"Version 4.9.11  :  Tuesday June 21, 2011","contents":"<li>Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>This release is now compatible with v10.7 Lion, developer preview.</li>\n<li>Addressed multiple selection issue when in browser mode.</li>\n<li>Addressed occasional application crash when moving file(s) to trash.</li>\n<li>General bug fixes.</li>","retrieved":1636349692066},{"title":"Version 4.9.10  :  Tuesday May 10, 2011","contents":"<li>Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Addressed performance issue when moving to Trash a lot of duplicate files.</li>\n<li>Added Duplicates Column to improve the handling and the display of duplicate files and folders.</li>\n<li>Duplicate blocks are now sorted by path name.</li>\n<li>Addressed the issue of duplicate symlink files, the symlink files are now properly moved to trash and the UI is properly updated.</li>\n<li>Addressed CSV export where the file name was not being included into the file path.</li>\n<li>Addressed right click context menu bug, we were not selecting the proper item before the context action.</li>","retrieved":1636349692067},{"title":"Version 4.9.9  :  Tuesday April 19, 2011","contents":"<li>Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added modified date to the CSV exports.</li>\n<li>Added ability to export very large folders.</li>\n<li>Fixed intermittent crash when updating using Sparkle.</li>","retrieved":1636349692068},{"title":"Version 4.9.8  :  Tuesday October 5, 2010","contents":"<li>Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added \"CMD+i\", or right click context menu \"Selection size\". Will display size info for a selection on the Table View.</li>\n<li>Added \"Help-&gt;User Guide\" Menu item and PDF.</li>\n<li>Corrected License Agreement in that \"one seat license permits installation on two computers for any number of users\".</li>\n<li>Addressed issue with QuickLook on SnowLeopard. Apple's QuickLook is available on 10.5 and 10.6 but not 10.4</li>\n<li>Addressed issue with name sorting. The new implementation uses case insensitive sorting.</li>\n<li>Addressed issue were the values reported on the bottom left status of the Table View were incorrect.</li>","retrieved":1636349692074},{"title":"Version 4.9.7  :  Thursday August 26, 2010","contents":"<li>Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Addressed issue with 'removable' file:// volumes, ie: idevices mounted as drives.</li>\n<li>Addressed issue with 'fusefs' type volumes, ie: idevices mounted as drives.</li>\n<li>Addressed issue when .Trash folders can not be moved to Trash.</li>\n<li>Addressed issue with the sparkle update engine, the sparkle update windows are now properly attached to the main window for a better workflow.</li>","retrieved":1636349692074},{"title":"Version 4.9.6  :  Monday July 12, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Addressed issue when manually entering license keys.</li>\n<li>Addressed issue when performing duplicate search on old slow machines and very large files.</li>","retrieved":1636349692075},{"title":"Version 4.9.5  :  Tuesday May 11, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Addressed issue with NSException backtracks in SnowLeopard and machines that do not have the atos utility installed. This was causing an application crash.</li>\n<li>Addressed issue related to NSDistantObject exceptions. These were being bubbled up to the user level and should have not.</li>","retrieved":1636349692076},{"title":"Version 4.9.4  :  Tuesday May 11, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Bug fixes, enhacements, to handle uncaught exceptions. Some of these issues were affecting users on SnowLeopard.\n</li>\n<li>Uncaught exceptions are now caught and presented in a clean UI. You can mail these to our servers for analysis. This will help us get feedback and resolve special case issues a lot easier than before. The UI was inspired by Apple's built in crash log reporter.</li>","retrieved":1636349692077},{"title":"Version 4.9.3  :  Wednesday March 24, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Bug fixes, enhacements, to the Find Duplicate Files functionality.\n\t</li>\n<li>Clicking on the app icon (from the Dock) will bring up the main window if none is visible. This behavior is similar to Apple's Finder.\n\t</li>\n<li>The check for updates setting on the Preferences Window now sticks.\n\t</li>\n<li>When measuring or refreshing a folder under PieChart the User Interface will refresh itself.\n\t</li>\n<li>Added menu item to reset the Find Duplicates database.\n\t</li>\n<li>More accurate time estimates when building the duplicates database.\n\t</li>\n<li>Added support for multiple seat keys. You need to purchase one of these if you plan to use the software on more than 3 machines.\n\t</li>\n<li>Added key validation to our website servers. At this time we check only for blacklisted keys, which is always a problem. We allow a one seat key to be used in up to 3 machines. If the key is blacklisted the software will revert to demo mode.\n\t</li>","retrieved":1636349692078},{"title":"Version 4.9.2  :  Tuesday April 13, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Bug fixes, enhacements, to the Find Duplicate Files functionality.\n\t</li>","retrieved":1636349692080},{"title":"Version 4.9.1  :  Tuesday February 23, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Bug fixes, enhancements, to the Find Duplicate Files functionality.\n\t</li>\n<li>Bug fixes, enhancements, to the Lipo Suction, functionality.\n\t</li>\n<li>Added tool bar icon and menu item.\n\t</li>","retrieved":1636349692082},{"title":"Version 4.9.0  :  Tuesday February 2, 2010","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added Duplicate Files functionality. We consider two files to be duplicates if they have the same md5 hash value. Figuring out the md5 hashes can be a long and expensive operation, so we will build the hash values in the background and store them into a database for convenience. If the files are modified the md5 hashes will be recalculated. You'd be suprised at how many duplicate files are out there.\n\t</li>\n<li>We will skip the following file names: .svn, build, cvs, *.app, *.framework, *.bundle, */library/caches/ \n                        We plan to allow for more control in a future release using a preference panel.\n\t</li>\n<li>Fixed SnowLeopard bug crash related to Java.\n\t</li>\n<li>Fixed SnowLeopard file size math. In SnowLeopard one KB is 1000 so Apple went to multiples of 1000 rather than multiples of 1024 when displaying the compact file size.\n\t</li>\n<li>Modified QuickLookUI loading to prevent crash on SnowLeopard.\n\t</li>","retrieved":1636349692084},{"title":"Version 4.8.3  :  Tuesday November 17, 2009","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users. Recommended to all SnowLeopard Users.</li>\n<li>Major fixes in memory usage. For example while measuring a Volume with 350GB worth of data the app will consume 250MB less of memory. Minor speed improvements as well.\n\t</li>\n<li>Improvements to the Delocalizer engine.\n\t</li>","retrieved":1636349692085},{"title":"Version 4.8.2  :  Monday October 19, 2009","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Minor bug fixes related to SnowLeopard.\n\t</li>","retrieved":1636349692087},{"title":"Version 4.8.1  :  Monday August 31, 2009","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Minor bug fixes related to SnowLeopard.\n\t</li>","retrieved":1636349692089},{"title":"Version 4.8.0  :  Tuesday August 25, 2009","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added 'Lipo Suction' module. Remove those extra architecture bytes. When Apple moved to universal binaries, the binaries got twice as big. You can lipo the binary files add keep only the native architecture bytes. For example if you are running on a PPC machine you could get rid of all the Intel binaries.\n\t</li>","retrieved":1636349692090},{"title":"Version 4.6.0  :  Tuesday May 12th, 2009","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added 'Last Modified' date column.\n\t</li>\n<li>Added sorting by the 'Last Modified' date column. You can use this feature to find, remove those old files that you have not used in forever.\n\t</li>\n<li>Added filtering of files/folders by 'Last Modified' date column.\n\t</li>\n<li>Added 'Exact Match' when filtering of files/folders by 'File Name' column\n\t</li>\n<li>Added preferences panel to allow power users to remove files as sudo.\n\t</li>\n<li>Fixed crash when removing files/folders as sudo.\n\t</li>\n<li>Optimized code when removing large number of files/folders.\n\t</li>\n<li>Optimized code when sorting by name.\n\t</li>","retrieved":1636349692093},{"title":"Version 4.5.2  :  Wednesday April 22nd, 2009","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Fixed crash when calling Delocalize without a node or folder selection\n\t</li>\n<li>Added 'Delocalize' to the left menu bar context menu.\n\t</li>\n<li>Added 'Show/Hide File Counts' to the Browser View context menu.\n\t</li>","retrieved":1636349692094},{"title":"Version 4.5.1  :  Monday March 16th, 2009","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Fixed 'Copy Path' context menu to copy paths as string, we were copying as xml.\n\t</li>\n<li>Fixed menu access for the context right menu.\n\t</li>\n<li>Added 'Delocalize Selected Node' context menu to allow delocalizing a selected folder.\n\t</li>","retrieved":1636349692096},{"title":"Version 4.4.2  :  Monday March 2nd, 2009","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added Delocalizer module. Remove those unwanted locales for languages you never knew existed.\n\t</li>","retrieved":1636349692097},{"title":"Version 4.4.1  :  Tuesday December 2nd, 2008","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added new database engine for speed and scalability to support large file systems with more than 4 million files and folders.\n\t</li>\n<li>Added multiple code optimizations, reduced memory footprint and patched a few minor leaks. This will allow the app to be used for longer periods of time.\n\t</li>\n<li>Added support for QuickLook on Leopard.\n\t</li>\n<li>Added preference pane.\n\t</li>","retrieved":1636349692098},{"title":"Version 4.3.1  :  Tuesday August 19th, 2008","contents":"<li>Updates. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. We regret to drop support for OSX 10.3 users. This version will now work only on 10.4 and above.</li>\n<li>Properly updating the window title when reloading the TableView mode.\n\t</li>\n<li>Code fix to properly shut down the measuring thread. We were not stopping this thread and thus causing unnecessary cpu usage.\n\t</li>\n<li>Now we can re-order items under PLACES using drag and drop.\n\t</li>","retrieved":1636349692100},{"title":"Version 4.3.0  :  Monday August 18th, 2008","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Thanks to support from our customers we have spent a lot of time to make this simple app even more useful. This is a Free update.\n\t</li>\n<li>Multiple fixes under the hood have been made to improve the integrity of measurements. One example is that Finder ignores the Folder size. Folders just like Files take disk space, they store information about the Files/Folders they contain. This information is managed by the Operating System. Our measurements will appear larger than those from Finder, but will be a bit more accurate.\n\t</li>\n<li>The app will consult with the file system to prevent existing measurements from going stale.\n\t</li>\n<li>The local Trash icon gets updated in real time when moving items to the Trash.\n\t</li>\n<li>We now allow users to move items to the Trash as Administrator, but only items that reside under /Users. This is done to prevent removal of critical Files by mistake. We plan to enhance this feature in a future release.\n\t</li>\n<li>There are now contextual menus to sort as well as Export a selection of files as csv for further processing.\n\t</li>\n<li>We now display the File/Folder icons.\n\t</li>\n<li>The app will remember the last sort function and use it on the next launch.\n\t</li>\n<li>Due to popular demand the main window will display a tool bar. All tool bar functions are accessible using menu short cuts.\n\t</li>\n<li>We have added the ability to refresh just one node, recursively. This function gets kicked automatically when on Browser View and the folder clicked has been updated since the last time it was measured.\n\t</li>\n<li>There is better feedback when moving items to the Trash fails.\n\t</li>","retrieved":1636349692101},{"title":"Version 4.2.0  :  Wednesday February, 13th, 2008","contents":"<li>Updates.</li>\n<li>Added PieChart view.\n\t</li>","retrieved":1636349692107},{"title":"Version 4.1.1  :  Thursday December, 27th, 2007","contents":"<li>10.3.9 Compatibility.</li>\n<li>Overall speed improvements to the serialization engine.\n\t</li>\n<li>Minor UI tweaks.\n\t</li>\n<li>Bug fixes related to 10.3.9 Panther.\n\t</li>","retrieved":1636349692108},{"title":"Version 4.1.0  :  Thursday December, 6th, 2007","contents":"<li>Added Persistence.\n\t</li>\n<li>Measured side bar items will now persist into ~/Library/Caches/WhatSize/. When the user clicks on a previously measured side bar item we will load the cached info in one instant. The cache is updated each time the user elects to re-measure a side bar item.\n\t</li>","retrieved":1636349692109},{"title":"Version 4.7.0  :  Monday June 22nd, 2009","contents":"<li>Updates. Free to all users. DO NOT UPDATE IF YOU ARE USING MAC OSX 10.3. Recommended to all Users.</li>\n<li>Added 'Nib'o Suction' module. Remove those unwanted nib files, developers forgot to. These files are used for developing software and are not used by the installed software. They can safely be removed.\n\t</li>\n<li>Added 'Nib'o Suction' to the different context menus. You can remove the unused nib files from a specific folder with pinpoint accuracy.\n\t</li>\n<li>Added 'Show/Hide File Icon' to the Browser View context menu.\n\t</li>\n<li>Added 'Customize' Size filtering on the Table View to find files using custom size range.\n\t</li>","retrieved":1636349692110},{"title":"Version 4.0  :  Thursday November, 29th, 2007","contents":"<li>Complete Overhaul.\n\t</li>\n<li>Total redesign brings in a true client-server architecture. This means support for System Administrator so that even files owned by other users of the machine can be measured.\n\t</li>\n<li>Better ergonomics. We have redesigned the UI to follow Mac OSX, Leopard UI guidelines.\n\t</li>","retrieved":1636349692111}]}